social_problems/app/controllers/android_api_controller.rb

	def set_session user
		token = generate_token
		session = ApiToken.new token: token, user: user
		session.save ? token : "Error"
---
INSERT INTO "api_tokens" ("token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["token", "882f80fdd2c7efd1baca9ca49cc3a2d403f28c74"], ["user_id", 1], ["created_at", "2015-06-06 11:49:34.179675"], ["updated_at", "2015-06-06 11:49:34.179675"]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)